In [116]:
import numpy as np
import pandas as pd

SERIES

In [117]:
s = pd.Series([20, 40, 80, 50, 50, 80, 50])

In [118]:
s.sum()

np.int64(370)

In [119]:
s.max()

np.int64(80)

MEASURE OF CENTER TENDENCY

In [120]:
s.min()

np.int64(20)

In [121]:
s.mean()

np.float64(52.857142857142854)

In [122]:
s.median()

np.float64(50.0)

MEASURE OF SPREAD

In [123]:
s.std()

np.float64(21.38089935299395)

In [124]:
s.var()

np.float64(457.14285714285717)

In [125]:
s.value_counts()

50    3
80    2
40    1
20    1
Name: count, dtype: int64

In [126]:
s.index

RangeIndex(start=0, stop=7, step=1)

In [127]:
s.values

array([20, 40, 80, 50, 50, 80, 50])

DATAFRAME

In [128]:
student_data = pd.DataFrame({
    "name"      : ['AMAN', 'ANIL', 'AMAN', 'VINIT', 'MAHESH'],
    "age"       : [20, 21, 20, 22, 21],
    "physics"   : [10, 91, 60, 70, 80],
    "chimistry" : [20, 30, 50, 45, 35],
    "maths"     : [40, 52, 56, 60, 50]
})

In [129]:
student_data

     name  age  physics  chimistry  maths
0    AMAN   20       10         20     40
1    ANIL   21       91         30     52
2    AMAN   20       60         50     56
3   VINIT   22       70         45     60
4  MAHESH   21       80         35     50

In [130]:
student_data['total'] = student_data['physics'] + student_data['chimistry'] + student_data['maths']

In [131]:
student_data['percentage'] = round(student_data.total / 3, ndigits=2)

In [132]:
student_data.sort_values(by = 'percentage', ascending= False, inplace= True, ignore_index= True )

In [133]:
student_data

     name  age  physics  chimistry  maths  total  percentage
0   VINIT   22       70         45     60    175       58.33
1    ANIL   21       91         30     52    173       57.67
2    AMAN   20       60         50     56    166       55.33
3  MAHESH   21       80         35     50    165       55.00
4    AMAN   20       10         20     40     70       23.33

In [ ]:
def give_grades(percent):
    if percent < 33:
        return "F"
    
    elif percent < 50:
        return "C"
    
    elif percent < 60:
        return "B"
    
    elif percent < 90:
        return "A"
    
    else:
        return "A+"

In [139]:
student_data['grades'] = student_data['percentage'].apply(func= give_grades)

In [ ]:
# BOOLEAN INDEXING

In [ ]:
# find out names of those whose age is more than 21
# find out data of those who got failed
# find out those who got grade a or a+

In [150]:
student_data[student_data['maths'] > 55]

    name  age  physics  chimistry  maths  total  percentage grades
0  VINIT   22       70         45     60    175       58.33      B
2   AMAN   20       60         50     56    166       55.33      B